Ran Plan for dir: `env/team-devops/dev` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
 <= read (data resources)

Terraform will perform the following actions:

  # module.ec2.data.aws_ami.amazon-linux-2 will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ami" "amazon-linux-2" {
      + architecture          = (known after apply)
      + arn                   = (known after apply)
      + block_device_mappings = (known after apply)
      + boot_mode             = (known after apply)
      + creation_date         = (known after apply)
      + deprecation_time      = (known after apply)
      + description           = (known after apply)
      + ena_support           = (known after apply)
      + hypervisor            = (known after apply)
      + id                    = (known after apply)
      + image_id              = (known after apply)
      + image_location        = (known after apply)
      + image_owner_alias     = (known after apply)
      + image_type            = (known after apply)
      + imds_support          = (known after apply)
      + kernel_id             = (known after apply)
      + most_recent           = true
      + name                  = (known after apply)
      + owner_id              = (known after apply)
      + platform              = (known after apply)
      + platform_details      = (known after apply)
      + product_codes         = (known after apply)
      + public                = (known after apply)
      + ramdisk_id            = (known after apply)
      + root_device_name      = (known after apply)
      + root_device_type      = (known after apply)
      + root_snapshot_id      = (known after apply)
      + sriov_net_support     = (known after apply)
      + state                 = (known after apply)
      + state_reason          = (known after apply)
      + tags                  = (known after apply)
      + tpm_support           = (known after apply)
      + usage_operation       = (known after apply)
      + virtualization_type   = (known after apply)

      + filter {
          + name   = "name"
          + values = [
              + "amzn2-ami-hvm*",
            ]
        }
      + filter {
          + name   = "owner-alias"
          + values = [
              + "amazon",
            ]
        }
    }

  # module.ec2.aws_instance.ec2["ec2_atlantis"] will be created
+ resource "aws_instance" "ec2" {
      + ami                                  = (known after apply)
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = true
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "terraform-atlantis-key"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name"      = "ec2-atlantis-stg"
          + "createdBy" = "devops-admin@gmail.com"
          + "env"       = "stg"
          + "managedBy" = "terraform"
          + "project"   = "terraform-ecs"
          + "teamTag"   = "devops"
        }
      + tags_all                             = {
          + "Name"      = "ec2-atlantis-stg"
          + "createdBy" = "devops-admin@gmail.com"
          + "env"       = "stg"
          + "managedBy" = "terraform"
          + "project"   = "terraform-ecs"
          + "teamTag"   = "devops"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "b815596d1c634ea77482ec1c0b91ddd7b6951bc2"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + maintenance_options (known after apply)

      + metadata_options (known after apply)

      + network_interface (known after apply)

      + private_dns_name_options (known after apply)

      + root_block_device (known after apply)
    }

  # module.ec2.aws_key_pair.ec2_key_pair["ec2_atlantis"] will be created
+ resource "aws_key_pair" "ec2_key_pair" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = "terraform-atlantis-key"
      + key_name_prefix = (known after apply)
      + key_pair_id     = (known after apply)
      + key_type        = (known after apply)
      + public_key      = (known after apply)
      + tags_all        = (known after apply)
    }

  # module.ec2.aws_security_group.ec2_security_group["terraform-atlantis-sg"] will be created
+ resource "aws_security_group" "ec2_security_group" {
      + arn                    = (known after apply)
      + description            = "Security group for ec2 with terraform atlantis"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "terraform-atlantis-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"      = "terraform-atlantis-sg-stg"
          + "createdBy" = "devops-admin@gmail.com"
          + "env"       = "stg"
          + "managedBy" = "terraform"
          + "project"   = "terraform-ecs"
          + "teamTag"   = "devops"
        }
      + tags_all               = {
          + "Name"      = "terraform-atlantis-sg-stg"
          + "createdBy" = "devops-admin@gmail.com"
          + "env"       = "stg"
          + "managedBy" = "terraform"
          + "project"   = "terraform-ecs"
          + "teamTag"   = "devops"
        }
      + vpc_id                 = (known after apply)
    }

  # module.ec2.aws_security_group_rule.ec2_egress_security_group["terraform-atlantis-sg-egress-0-0"] will be created
+ resource "aws_security_group_rule" "ec2_egress_security_group" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow all outbound traffic"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.ec2.aws_security_group_rule.ec2_ingress_security_group["terraform-atlantis-sg-ingress-22-22"] will be created
+ resource "aws_security_group_rule" "ec2_ingress_security_group" {
      + cidr_blocks              = [
          + "39.118.148.0/24",
          + "220.75.180.73/32",
        ]
      + description              = "EC2 atlantis ssh enter"
      + from_port                = 22
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "ingress"
    }

  # module.ec2.aws_security_group_rule.ec2_ingress_security_group["terraform-atlantis-sg-ingress-4141-4141"] will be created
+ resource "aws_security_group_rule" "ec2_ingress_security_group" {
      + cidr_blocks              = [
          + "192.30.252.0/22",
          + "185.199.108.0/22",
          + "140.82.112.0/20",
          + "39.118.148.0/24",
          + "220.75.180.73/32",
        ]
      + description              = "EC2 atlantis Github web hook & Desktop enter"
      + from_port                = 4141
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 4141
      + type                     = "ingress"
    }

  # module.ec2.local_file.ec2_key_pair_local_file["ec2_atlantis"] will be created
+ resource "local_file" "ec2_key_pair_local_file" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0600"
      + filename             = "../../../modules/aws/compute/ec2/keypair/terraform-atlantis-key.pem"
      + id                   = (known after apply)
    }

  # module.ec2.tls_private_key.ec2_key_pair_rsa["ec2_atlantis"] will be created
+ resource "tls_private_key" "ec2_key_pair_rsa" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 4096
    }

  # module.ecr.aws_ecr_repository.ecr_repository["core-filebeat"] will be created
+ resource "aws_ecr_repository" "ecr_repository" {
      + arn                  = (known after apply)
      + force_delete         = false
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "core-filebeat-stg"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Name"      = "core-filebeat-stg"
          + "createdBy" = "devops-admin@gmail.com"
          + "env"       = "stg"
          + "managedBy" = "terraform"
          + "project"   = "terraform-ecs"
          + "teamTag"   = "devops"
        }
      + tags_all             = {
          + "Name"      = "core-filebeat-stg"
          + "createdBy" = "devops-admin@gmail.com"
          + "env"       = "stg"
          + "managedBy" = "terraform"
          + "project"   = "terraform-ecs"
          + "teamTag"   = "devops"
        }

      + image_scanning_configuration {
          + scan_on_push = false
        }
    }

  # module.ecr.aws_ecr_repository.ecr_repository["core-search-api-server"] will be created
+ resource "aws_ecr_repository" "ecr_repository" {
      + arn                  = (known after apply)
      + force_delete         = false
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "core-search-api-server-stg"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Name"      = "core-search-api-server-stg"
          + "createdBy" = "devops-admin@gmail.com"
          + "env"       = "stg"
          + "managedBy" = "terraform"
          + "project"   = "terraform-ecs"
          + "teamTag"   = "devops"
        }
      + tags_all             = {
          + "Name"      = "core-search-api-server-stg"
          + "createdBy" = "devops-admin@gmail.com"
          + "env"       = "stg"
          + "managedBy" = "terraform"
          + "project"   = "terraform-ecs"
          + "teamTag"   = "devops"
        }

      + image_scanning_configuration {
          + scan_on_push = false
        }
    }

  # module.ecs.data.template_file.container_definitions["core-search-td"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "template_file" "container_definitions" {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = <<-EOT
            [
              %{ for container in jsondecode(containers) }
              {
                "name": "${container.name}-${container.env}",
                "image": "${container.image}-${container.env}:${ecs_container_image_version}",
                "cpu": ${container.cpu},
                "memory": ${container.memory},
                "essential": ${container.essential},
                "portMappings": [
                  %{ if container.port != 0 }
                  {
                    "containerPort": ${container.port},
                    "hostPort": ${container.port},
                    "protocol": "tcp"
                  }
                  %{ endif }
                ],
                "environment": [
                  %{ for env_key, env_value in container.env_variables }
                  {
                    "name": "${env_key}",
                    "value": "${env_value}"
                  }%{ if env_key != keys(container.env_variables)[length(keys(container.env_variables)) - 1] },%{ endif }
                  %{ endfor }
                ],
                "mountPoints": ${jsonencode(container.mount_points)},
                "healthCheck": {
                  "command": ["CMD-SHELL", "${container.health_check.command}"],
                  "interval": ${container.health_check.interval},
                  "timeout": ${container.health_check.timeout},
                  "retries": ${container.health_check.retries}
                }
              }%{ if index(jsondecode(containers), container) < length(jsondecode(containers)) - 1 },%{ endif }
              %{ endfor }
            ]
        EOT
      + vars     = {
          + "containers"                  = jsonencode(
                [
                  + {
                      + cpu           = 512
                      + env           = "stg"
                      + env_variables = {
                          + SPRING_PROFILES_ACTIVE = "stg"
                          + TZ                     = "Asia/Seoul"
                        }
                      + essential     = true
                      + health_check  = {
                          + command  = "curl --fail http://127.0.0.1:8080/search/health || exit 1"
                          + interval = 30
                          + retries  = 3
                          + timeout  = 10
                        }
                      + image         = "863518443396.dkr.ecr.ap-northeast-2.amazonaws.com/core-search-api-server"
                      + memory        = 1024
                      + mount_points  = []
                      + name          = "core-search-api-server"
                      + port          = 8080
                    },
                  + {
                      + cpu           = 256
                      + env           = "stg"
                      + env_variables = {}
                      + essential     = true
                      + health_check  = {
                          + command  = "ps aux | grep filebeat || exit 1"
                          + interval = 30
                          + retries  = 3
                          + timeout  = 10
                        }
                      + image         = "863518443396.dkr.ecr.ap-northeast-2.amazonaws.com/core-filebeat"
                      + memory        = 512
                      + mount_points  = []
                      + name          = "core-filebeat"
                      + port          = 0
                    },
                ]
            )
          + "ecs_container_image_version" = "1.0.0"
        }
    }

  # module.ecs.aws_ecs_cluster.ecs_cluster["core-search-cluster"] will be created
+ resource "aws_ecs_cluster" "ecs_cluster" {
      + arn                = (known after apply)
      + capacity_providers = (known after apply)
      + id                 = (known after apply)
      + name               = "core-search-cluster-stg"
      + tags               = {
          + "Name"      = "core-search-cluster-stg"
          + "createdBy" = "devops-admin@gmail.com"
          + "env"       = "stg"
          + "managedBy" = "terraform"
          + "project"   = "terraform-ecs"
          + "teamTag"   = "devops"
        }
      + tags_all           = {
          + "Name"      = "core-search-cluster-stg"
          + "createdBy" = "devops-admin@gmail.com"
          + "env"       = "stg"
          + "managedBy" = "terraform"
          + "project"   = "terraform-ecs"
          + "teamTag"   = "devops"
        }

      + default_capacity_provider_strategy (known after apply)

      + setting (known after apply)
    }

  # module.ecs.aws_ecs_task_definition.ecs_task_definition["core-search-td"] will be created
+ resource "aws_ecs_task_definition" "ecs_task_definition" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "1024"
      + execution_role_arn       = (known after apply)
      + family                   = "core-search-td-stg"
      + id                       = (known after apply)
      + memory                   = "2048"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "Name"      = "core-search-td-stg"
          + "createdBy" = "devops-admin@gmail.com"
          + "env"       = "stg"
          + "managedBy" = "terraform"
          + "project"   = "terraform-ecs"
          + "teamTag"   = "devops"
        }
      + tags_all                 = {
          + "Name"      = "core-search-td-stg"
          + "createdBy" = "devops-admin@gmail.com"
          + "env"       = "stg"
          + "managedBy" = "terraform"
          + "project"   = "terraform-ecs"
          + "teamTag"   = "devops"
        }
      + task_role_arn            = (known after apply)

      + ephemeral_storage {
          + size_in_gib = 21
        }

      + runtime_platform {
          + cpu_architecture        = "X86_64"
          + operating_system_family = "LINUX"
        }

      + volume {
          + name      = "core-shared-volume"
            # (1 unchanged attribute hidden)
        }
    }

  # module.ecs.aws_security_group.ecs_security_group will be created
+ resource "aws_security_group" "ecs_security_group" {
      + arn                    = (known after apply)
      + description            = "Allow ECS Task inbound traffic and outbound traffic"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "core-search-ecs-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"      = "core-search-ecs-sg-stg"
          + "createdBy" = "devops-admin@gmail.com"
          + "env"       = "stg"
          + "managedBy" = "terraform"
          + "project"   = "terraform-ecs"
          + "teamTag"   = "devops"
        }
      + tags_all               = {
          + "Name"      = "core-search-ecs-sg-stg"
          + "createdBy" = "devops-admin@gmail.com"
          + "env"       = "stg"
          + "managedBy" = "terraform"
          + "project"   = "terraform-ecs"
          + "teamTag"   = "devops"
        }
      + vpc_id                 = (known after apply)
    }

  # module.ecs.aws_security_group_rule.ecs_ingress_security_group["http-alb"] will be created
+ resource "aws_security_group_rule" "ecs_ingress_security_group" {
      + description              = "Allow ecs service to receive traffic from Public ALB"
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # module.ecs.aws_security_group_rule.ecs_ingress_security_group["https-alb"] will be created
+ resource "aws_security_group_rule" "ecs_ingress_security_group" {
      + description              = "Allow ecs service to receive traffic from Public ALB"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.load_balancer.aws_lb.alb["terraform-ecs-alb"] will be created
+ resource "aws_lb" "alb" {
      + arn                                         = (known after apply)
      + arn_suffix                                  = (known after apply)
      + desync_mitigation_mode                      = "defensive"
      + dns_name                                    = (known after apply)
      + drop_invalid_header_fields                  = false
      + enable_deletion_protection                  = false
      + enable_http2                                = true
      + enable_tls_version_and_cipher_suite_headers = false
      + enable_waf_fail_open                        = false
      + enable_xff_client_port                      = false
      + id                                          = (known after apply)
      + idle_timeout                                = 300
      + internal                                    = false
      + ip_address_type                             = (known after apply)
      + load_balancer_type                          = "application"
      + name                                        = "terraform-ecs-alb-stg"
      + preserve_host_header                        = false
      + security_groups                             = (known after apply)
      + subnets                                     = (known after apply)
      + tags                                        = {
          + "Name"      = "terraform-ecs-alb-stg"
          + "createdBy" = "devops-admin@gmail.com"
          + "env"       = "stg"
          + "managedBy" = "terraform"
          + "project"   = "terraform-ecs"
          + "teamTag"   = "devops"
        }
      + tags_all                                    = {
          + "Name"      = "terraform-ecs-alb-stg"
          + "createdBy" = "devops-admin@gmail.com"
          + "env"       = "stg"
          + "managedBy" = "terraform"
          + "project"   = "terraform-ecs"
          + "teamTag"   = "devops"
        }
      + vpc_id                                      = (known after apply)
      + xff_header_processing_mode                  = "append"
      + zone_id                                     = (known after apply)

      + subnet_mapping (known after apply)
    }

  # module.load_balancer.aws_lb_listener.alb_listener["terraform-ecs-alb-http-listener"] will be created
+ resource "aws_lb_listener" "alb_listener" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags              = {
          + "Name"      = "terraform-ecs-alb-http-listener-stg"
          + "createdBy" = "devops-admin@gmail.com"
          + "env"       = "stg"
          + "managedBy" = "terraform"
          + "project"   = "terraform-ecs"
          + "teamTag"   = "devops"
        }
      + tags_all          = {
          + "Name"      = "terraform-ecs-alb-http-listener-stg"
          + "createdBy" = "devops-admin@gmail.com"
          + "env"       = "stg"
          + "managedBy" = "terraform"
          + "project"   = "terraform-ecs"
          + "teamTag"   = "devops"
        }

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # module.load_balancer.aws_lb_listener_rule.alb_listener_rule["terraform-ecs-alb-http-listener-search-rule"] will be created
+ resource "aws_lb_listener_rule" "alb_listener_rule" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = 1
      + tags_all     = (known after apply)

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + path_pattern {
              + values = [
                  + "/api/v1/*",
                  + "/search/*",
                ]
            }
        }
    }

  # module.load_balancer.aws_lb_target_group.target_group["terraform-ecs-search-tg"] will be created
+ resource "aws_lb_target_group" "target_group" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "terraform-ecs-search-tg-stg"
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name"      = "terraform-ecs-search-tg-stg"
          + "createdBy" = "devops-admin@gmail.com"
          + "env"       = "stg"
          + "managedBy" = "terraform"
          + "project"   = "terraform-ecs"
          + "teamTag"   = "devops"
        }
      + tags_all                           = {
          + "Name"      = "terraform-ecs-search-tg-stg"
          + "createdBy" = "devops-admin@gmail.com"
          + "env"       = "stg"
          + "managedBy" = "terraform"
          + "project"   = "terraform-ecs"
          + "teamTag"   = "devops"
        }
      + target_type                        = "ip"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = (known after apply)
          + path                = (known after apply)
          + port                = "8080"
          + protocol            = "HTTP"
          + timeout             = 15
          + unhealthy_threshold = 5
        }

      + stickiness (known after apply)

      + target_failover (known after apply)
    }

  # module.load_balancer.aws_security_group.alb_security_group will be created
+ resource "aws_security_group" "alb_security_group" {
      + arn                    = (known after apply)
      + description            = "Allow Public inbound traffic and outbound traffic"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "terraform-ecs-alb-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"      = "terraform-ecs-alb-sg-stg"
          + "createdBy" = "devops-admin@gmail.com"
          + "env"       = "stg"
          + "managedBy" = "terraform"
          + "project"   = "terraform-ecs"
          + "teamTag"   = "devops"
        }
      + tags_all               = {
          + "Name"      = "terraform-ecs-alb-sg-stg"
          + "createdBy" = "devops-admin@gmail.com"
          + "env"       = "stg"
          + "managedBy" = "terraform"
          + "project"   = "terraform-ecs"
          + "teamTag"   = "devops"
        }
      + vpc_id                 = (known after apply)
    }

  # module.load_balancer.aws_security_group_rule.alb_security_group_rule["http-ingress"] will be created
+ resource "aws_security_group_rule" "alb_security_group_rule" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow Public inbound traffic and outbound traffic"
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # module.load_balancer.aws_security_group_rule.alb_security_group_rule["https-ingress"] will be created
+ resource "aws_security_group_rule" "alb_security_group_rule" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow Public inbound traffic and outbound traffic"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.network.aws_eip.ngw_eip will be created
+ resource "aws_eip" "ngw_eip" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name"      = "terraform-ecs-ngw-eip-stg"
          + "createdBy" = "devops-admin@gmail.com"
          + "env"       = "stg"
          + "managedBy" = "terraform"
          + "project"   = "terraform-ecs"
          + "teamTag"   = "devops"
        }
      + tags_all             = {
          + "Name"      = "terraform-ecs-ngw-eip-stg"
          + "createdBy" = "devops-admin@gmail.com"
          + "env"       = "stg"
          + "managedBy" = "terraform"
          + "project"   = "terraform-ecs"
          + "teamTag"   = "devops"
        }
      + vpc                  = true
    }

  # module.network.aws_internet_gateway.igw will be created
+ resource "aws_internet_gateway" "igw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name"      = "terraform-ecs-igw-stg"
          + "createdBy" = "devops-admin@gmail.com"
          + "env"       = "stg"
          + "managedBy" = "terraform"
          + "project"   = "terraform-ecs"
          + "teamTag"   = "devops"
        }
      + tags_all = {
          + "Name"      = "terraform-ecs-igw-stg"
          + "createdBy" = "devops-admin@gmail.com"
          + "env"       = "stg"
          + "managedBy" = "terraform"
          + "project"   = "terraform-ecs"
          + "teamTag"   = "devops"
        }
      + vpc_id   = (known after apply)
    }

  # module.network.aws_nat_gateway.ngw will be created
+ resource "aws_nat_gateway" "ngw" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Name"      = "terraform-ecs-ngw-stg"
          + "createdBy" = "devops-admin@gmail.com"
          + "env"       = "stg"
          + "managedBy" = "terraform"
          + "project"   = "terraform-ecs"
          + "teamTag"   = "devops"
        }
      + tags_all             = {
          + "Name"      = "terraform-ecs-ngw-stg"
          + "createdBy" = "devops-admin@gmail.com"
          + "env"       = "stg"
          + "managedBy" = "terraform"
          + "project"   = "terraform-ecs"
          + "teamTag"   = "devops"
        }
    }

  # module.network.aws_route_table.private_route_table will be created
+ resource "aws_route_table" "private_route_table" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + nat_gateway_id             = (known after apply)
                # (12 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Name"      = "terraform-ecs-rt-pri-stg"
          + "createdBy" = "devops-admin@gmail.com"
          + "env"       = "stg"
          + "managedBy" = "terraform"
          + "project"   = "terraform-ecs"
          + "teamTag"   = "devops"
        }
      + tags_all         = {
          + "Name"      = "terraform-ecs-rt-pri-stg"
          + "createdBy" = "devops-admin@gmail.com"
          + "env"       = "stg"
          + "managedBy" = "terraform"
          + "project"   = "terraform-ecs"
          + "teamTag"   = "devops"
        }
      + vpc_id           = (known after apply)
    }

  # module.network.aws_route_table.public_route_table will be created
+ resource "aws_route_table" "public_route_table" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + gateway_id                 = (known after apply)
                # (12 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Name"      = "terraform-ecs-rt-pub-stg"
          + "createdBy" = "devops-admin@gmail.com"
          + "env"       = "stg"
          + "managedBy" = "terraform"
          + "project"   = "terraform-ecs"
          + "teamTag"   = "devops"
        }
      + tags_all         = {
          + "Name"      = "terraform-ecs-rt-pub-stg"
          + "createdBy" = "devops-admin@gmail.com"
          + "env"       = "stg"
          + "managedBy" = "terraform"
          + "project"   = "terraform-ecs"
          + "teamTag"   = "devops"
        }
      + vpc_id           = (known after apply)
    }

  # module.network.aws_route_table_association.private_route_table_association[0] will be created
+ resource "aws_route_table_association" "private_route_table_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.aws_route_table_association.private_route_table_association[1] will be created
+ resource "aws_route_table_association" "private_route_table_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.aws_route_table_association.public_route_table_association[0] will be created
+ resource "aws_route_table_association" "public_route_table_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.aws_route_table_association.public_route_table_association[1] will be created
+ resource "aws_route_table_association" "public_route_table_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.aws_subnet.private_subnet[0] will be created
+ resource "aws_subnet" "private_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.22.20.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"      = "terraform-ecs-sub-pri-stg-01"
          + "createdBy" = "devops-admin@gmail.com"
          + "env"       = "stg"
          + "managedBy" = "terraform"
          + "project"   = "terraform-ecs"
          + "teamTag"   = "devops"
        }
      + tags_all                                       = {
          + "Name"      = "terraform-ecs-sub-pri-stg-01"
          + "createdBy" = "devops-admin@gmail.com"
          + "env"       = "stg"
          + "managedBy" = "terraform"
          + "project"   = "terraform-ecs"
          + "teamTag"   = "devops"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_subnet.private_subnet[1] will be created
+ resource "aws_subnet" "private_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.22.21.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"      = "terraform-ecs-sub-pri-stg-02"
          + "createdBy" = "devops-admin@gmail.com"
          + "env"       = "stg"
          + "managedBy" = "terraform"
          + "project"   = "terraform-ecs"
          + "teamTag"   = "devops"
        }
      + tags_all                                       = {
          + "Name"      = "terraform-ecs-sub-pri-stg-02"
          + "createdBy" = "devops-admin@gmail.com"
          + "env"       = "stg"
          + "managedBy" = "terraform"
          + "project"   = "terraform-ecs"
          + "teamTag"   = "devops"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_subnet.public_subnet[0] will be created
+ resource "aws_subnet" "public_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.22.10.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"      = "terraform-ecs-sub-pub-stg-01"
          + "createdBy" = "devops-admin@gmail.com"
          + "env"       = "stg"
          + "managedBy" = "terraform"
          + "project"   = "terraform-ecs"
          + "teamTag"   = "devops"
        }
      + tags_all                                       = {
          + "Name"      = "terraform-ecs-sub-pub-stg-01"
          + "createdBy" = "devops-admin@gmail.com"
          + "env"       = "stg"
          + "managedBy" = "terraform"
          + "project"   = "terraform-ecs"
          + "teamTag"   = "devops"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_subnet.public_subnet[1] will be created
+ resource "aws_subnet" "public_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.22.11.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"      = "terraform-ecs-sub-pub-stg-02"
          + "createdBy" = "devops-admin@gmail.com"
          + "env"       = "stg"
          + "managedBy" = "terraform"
          + "project"   = "terraform-ecs"
          + "teamTag"   = "devops"
        }
      + tags_all                                       = {
          + "Name"      = "terraform-ecs-sub-pub-stg-02"
          + "createdBy" = "devops-admin@gmail.com"
          + "env"       = "stg"
          + "managedBy" = "terraform"
          + "project"   = "terraform-ecs"
          + "teamTag"   = "devops"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_vpc.main will be created
+ resource "aws_vpc" "main" {
      + arn                                  = (known after apply)
      + cidr_block                           = "172.22.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name"      = "terraform-ecs-vpc-stg"
          + "createdBy" = "devops-admin@gmail.com"
          + "env"       = "stg"
          + "managedBy" = "terraform"
          + "project"   = "terraform-ecs"
          + "teamTag"   = "devops"
        }
      + tags_all                             = {
          + "Name"      = "terraform-ecs-vpc-stg"
          + "createdBy" = "devops-admin@gmail.com"
          + "env"       = "stg"
          + "managedBy" = "terraform"
          + "project"   = "terraform-ecs"
          + "teamTag"   = "devops"
        }
    }

  # module.security.aws_iam_policy.ecs_task_exec_role_policy will be created
+ resource "aws_iam_policy" "ecs_task_exec_role_policy" {
      + arn         = (known after apply)
      + description = "custom_ecs_task_exec_role_policy"
      + id          = (known after apply)
      + name        = "custom_ecs_task_exec_role_policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ecr:GetAuthorizationToken",
                          + "ecr:BatchCheckLayerAvailability",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:BatchGetImage",
                          + "ecr:GetRepositoryPolicy",
                          + "ecr:DescribeRepositories",
                          + "ecr:ListImages",
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.security.aws_iam_policy.ecs_task_role_policy will be created
+ resource "aws_iam_policy" "ecs_task_role_policy" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "custom_ecs_task_role_policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:ListBucket",
                          + "s3:GetObject",
                          + "s3:PutObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.security.aws_iam_role.ecs_auto_scaling_role will be created
+ resource "aws_iam_role" "ecs_auto_scaling_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "application-autoscaling.amazonaws.com"
                        }
                      + Sid       = "AutoScaling"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ecs_auto_scaling_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.security.aws_iam_role.ecs_task_exec_role will be created
+ resource "aws_iam_role" "ecs_task_exec_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ecs_task_exec_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.security.aws_iam_role.ecs_task_role will be created
+ resource "aws_iam_role" "ecs_task_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ecs_task_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.security.aws_iam_role_policy_attachment.ecs_auto_scaling_role_policy_attachment will be created
+ resource "aws_iam_role_policy_attachment" "ecs_auto_scaling_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceAutoscaleRole"
      + role       = "ecs_auto_scaling_role"
    }

  # module.security.aws_iam_role_policy_attachment.ecs_task_exec_role_policy will be created
+ resource "aws_iam_role_policy_attachment" "ecs_task_exec_role_policy" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "ecs_task_exec_role"
    }

  # module.security.aws_iam_role_policy_attachment.ecs_task_role_attachment will be created
+ resource "aws_iam_role_policy_attachment" "ecs_task_role_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "ecs_task_role"
    }

  # module.storage.aws_dynamodb_table.terraform_state_lock will be created
+ resource "aws_dynamodb_table" "terraform_state_lock" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "LockID"
      + id               = (known after apply)
      + name             = "tfstate-lock"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = (known after apply)
      + write_capacity   = (known after apply)

      + attribute {
          + name = "LockID"
          + type = "S"
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # module.storage.aws_s3_bucket.terraform_state["terraform_state"] will be created
+ resource "aws_s3_bucket" "terraform_state" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "terraform-s3-ymkim-state"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name"      = "terraform-s3-ymkim-state-stg"
          + "createdBy" = "devops-admin@gmail.com"
          + "env"       = "stg"
          + "managedBy" = "terraform"
          + "project"   = "terraform-ecs"
          + "teamTag"   = "devops"
        }
      + tags_all                    = {
          + "Name"      = "terraform-s3-ymkim-state-stg"
          + "createdBy" = "devops-admin@gmail.com"
          + "env"       = "stg"
          + "managedBy" = "terraform"
          + "project"   = "terraform-ecs"
          + "teamTag"   = "devops"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.storage.aws_s3_bucket_public_access_block.terraform_state["terraform_state"] will be created
+ resource "aws_s3_bucket_public_access_block" "terraform_state" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.storage.aws_s3_bucket_server_side_encryption_configuration.terraform_state["terraform_state"] will be created
+ resource "aws_s3_bucket_server_side_encryption_configuration" "terraform_state" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm     = "AES256"
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.storage.aws_s3_bucket_versioning.terraform_state["terraform_state"] will be created
+ resource "aws_s3_bucket_versioning" "terraform_state" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

Plan: 49 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ debug_compute_module       = (sensitive value)
+ debug_ec2                  = (sensitive value)
+ debug_ecr_module           = (sensitive value)
+ debug_load_balancer_module = (sensitive value)
+ debug_network_module       = (sensitive value)
+ debug_security_module      = (sensitive value)
+ debug_storage_module       = (sensitive value)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d env/team-devops/dev
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://18185b44d4fa:4141/lock?id=ym1085%252Fterraform-for-ECS%252Fenv%252Fteam-devops%252Fdev%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d env/team-devops/dev
  ```
Plan: 49 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```